{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Wade Armstrong",
	"language": "en",
	"home_page_url": "https://wadearmstrong.com/",
	"feed_url": "https://wadearmstrong.com/feed/feed.json",
	"description": "Engineering Leader With Proven Record of Building High-Performing, Quality-Oriented Teams.",
	"author": {
		"name": "Wade Armstrong",
		"url": "https://wadearmstrong.com/README/"
	},
	"items": [
		{
			"id": "https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/",
			"url": "https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/",
			"title": "How to Start a Ticket",
			"content_html": "<h1 id=\"how-to-start-a-ticket\" tabindex=\"-1\">How to Start a Ticket <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h1>\n<p>With just an hour or two of work up-front, it's possible to avoid many of the reasons stories become frustrating and unpleasant. Don't get your PRs kicked back; do your work up front.</p>\n<ol>\n<li><strong>Get All the Answers.</strong> Product and UX's job is to help you resolve all the edge cases. Make sure you understand:</li>\n</ol>\n<ul>\n<li>What to do if operations fail (bad user input, bad API response, bad login state, etc.)</li>\n<li>What device types you need to make this work on</li>\n<li>Confirm that any changed text, links, etc., is actually meant to change and not a typo</li>\n</ul>\n<ol start=\"2\">\n<li><strong>Did someone else do it before?</strong> If your goal is not to create something totally new in the codebase, then it's possible that others have done something similar before. Even if you're doing something new, it may be that other people have had to deal with the same interfaces in completing their tickets. Searching completed tickets for some of the keywords in your ticket can often reveal past pull requests that can act as signposts on your path, or even give you some of the code you need. It's not cheating, it's understanding the codebase and applying past best practices.</li>\n<li><strong>Assess ways to do the ticket.</strong> Read the code and understand how things work in the module (if you're developing something from scratch, find similar things and understand how they work). If you want to discuss your approach with others, one option is to outline multiple options in ticket comments and direct the discussion there. It may also help to draw pictures at this stage.</li>\n<li><strong>Consult a Colleague.</strong> Ask someone what they think of your approaches. Senior and Principal Engineers are specifically paid to do these things, so don't be shy about asking them. If you're not co-located, tag them in the ticket comments (make sure to communicate out-of-band so they expect it). Agree on a preferred approach.</li>\n<li><strong>Go to a Domain Expert.</strong> If another team often works with this kind of code , then reach out to validate your approach.</li>\n<li><strong>Document the Chosen Approach.</strong> Describe the approach in the ticket comments. This comment doesn't need to be all-encompassing, but, if someone finds the ticket in 8 months and needs to do the same thing, they should be able to get a good start from your comment.</li>\n</ol>\n<h2 id=\"faq\" tabindex=\"-1\">FAQ <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h2>\n<h3 id=\"do-i-need-to-do-this-every-time\" tabindex=\"-1\">Do I need to do this every time? <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h3>\n<p>No, it's certainly too much effort for 1-day tickets, but the effort's worth it for anything you'll work on for longer.</p>\n<h3 id=\"seriously-this-seems-like-it-would-make-tickets-take-longer\" tabindex=\"-1\">Seriously, this seems like it would make tickets take longer <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h3>\n<p>What really take a long time, both in terms of how much of a given sprint it takes up and, maybe more importantly, in terms of <em>how long it feels</em>, is when a ticket gets kicked back multiple times from code review.</p>\n<p>Think of this as a way to push all your mistakes to early in the process, when they can be redone cheaply:</p>\n<ul>\n<li>Changing your mind in a conversation is easier than changing code</li>\n<li>Drawing a new line or a new entity on a whiteboard is easier than changing code</li>\n</ul>\n<p>Don't let yourself get bogged down, but, if you expect a ticket to take a few days, what's the downside of spending a couple hours up front?</p>\n<h3 id=\"shouldn-t-the-organization-trust-me-to-plan-my-story-on-my-own\" tabindex=\"-1\">Shouldn't the organization trust me to plan my story on my own? <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h3>\n<p>Sure, and they also trust you to execute the plan and write code. But most orgs also have code review, because we're all, together, smarter than any one of us, individually. Think of the above as &quot;idea review&quot;.</p>\n<h3 id=\"i-don-t-want-to-ask-dumb-questions-of-senior-engineers-that-makes-me-feel-dumb\" tabindex=\"-1\">I don't want to ask dumb questions of Senior Engineers, that makes me feel dumb. <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h3>\n<p>Answering those questions is literally in their job description, and they're literally evaluated on how well (and positively!) they answer them. You should never be made to feel dumb. If you are, let your manager know.</p>\n<h3 id=\"so-i-can-ask-any-dumb-question-then\" tabindex=\"-1\">So I can ask any dumb question, then? <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h3>\n<p>Ask your best question. Do enough research that you're comfortable you have a specific question that, when answered, will lead you forward. Some advice on asking good questions: <a href=\"https://stackoverflow.com/help/how-to-ask\">1</a> <a href=\"https://medium.com/@dan_abramov/asking-good-questions-421f08ee7e5c\">2</a>, <a href=\"https://medium.com/@gordon_zhu/how-to-be-great-at-asking-questions-e37be04d0603\">3</a>, <a href=\"http://www.catb.org/~esr/faqs/smart-questions.html\">4</a>, <a href=\"https://codeblog.jonskeet.uk/2012/11/24/stack-overflow-question-checklist/\">5</a>.</p>\n<p>Your best question probably expresses less understanding of a topic than a subject matter expert would have. If you knew all that SME knew, you wouldn't have a question (and you'd be the SME). Don't worry that you know less.</p>\n<h3 id=\"what-do-i-do-if-i-get-an-answer\" tabindex=\"-1\">What do I do if I get an answer? <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h3>\n<p>Document it! In the ticket comments, if it's trivial; if you think it would be useful to other people, in the permanent documentation, such as a wiki or generated docs. If you're not sure, you probably have your own page on a wiki, so put it there. Documenting things you learn helps you not have to ask the same questions again and again, which makes you faster and happier. Soon, you'll be the expert!</p>\n<h3 id=\"that-s-a-lot-of-documentation\" tabindex=\"-1\">That's a lot of documentation! <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/How%20to%20Start%20a%20Ticket/\">#</a></h3>\n<p>Would you rather write a few comments or have people keep asking you what's going on? Thought so.</p>\n",
			"date_published": "2023-05-12T00:00:00Z"
		}
		,
		{
			"id": "https://wadearmstrong.com/things/console-log_vs_breakpoint/",
			"url": "https://wadearmstrong.com/things/console-log_vs_breakpoint/",
			"title": "Console Log vs. Breakpoint",
			"content_html": "<h1 id=\"console-log-vs-breakpoint\" tabindex=\"-1\">Console Log vs. Breakpoint <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\">#</a></h1>\n<p>I <code>console.log</code> a lot. And I know that’s not always classy. Folks look at me crosswise because I don’t open up a debugger — and all Web browsers have quite good debuggers these days<sup class=\"footnote-ref\"><a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" id=\"fnref1\">[1]</a></sup> — but here’s the thing: it’s not just that I’m old-fashioned (although I am, and I certainly started developing well before decent in-browser debuggers), there’s acutally something about <code>console.log</code>ging (or fmt.printlning or echoing) that’s different than using a debugger. Logging out your code’s state is debugging from a specific perspective; using your browser debugger actually moves you to a different perspective.</p>\n<h3 id=\"how-perspectives-work\" tabindex=\"-1\">How Perspectives Work <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\">#</a></h3>\n<p>In the social sciences<sup class=\"footnote-ref\"><a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" id=\"fnref2\">[2]</a></sup>, there’s this concept of &quot;framing.&quot; A &quot;frame&quot; is a filter, more or less, through which we all take in and analyze information. Some filters are basic and come from our experiences in nature — &quot;Mom is good, this smells like Mom, it must be good&quot; — but most are socially-constructed — &quot;Eating fat makes me fat, so I’ll choose the 90% lean ground beef over the 10% fat ground beef.&quot;<sup class=\"footnote-ref\"><a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" id=\"fnref3\">[3]</a></sup></p>\n<p>While the filter itself is an abstract entity, neuropsychologists have considerable evidence that something much like frames actually exists in your brain. The Spreading Activation Theory holds that the likelihood an individual retrieves a memory is directly proportional to the strength of the connections to that memory. Think of memory like a graph, with nodes connected in the center as a crazy-quilt, but out at the edges as trees, with memory retrieval starting at the center. Each node on the graph is connected more strongly or more weakly to its neighbors; heck, think of components of memory as having PageRank. To get to a node on the edge, you need the path from the center to that edge to have sufficient strength throughout to get you there; but, once far enough down a path, the connections from a given node in that path to a node in a completely different path are much weaker than the within-path connections.</p>\n<p>A graph, showing a few childhood memories networked together, with GI Joe's Lt. Falcon way out on his own connected only to GI Joe, while other nodes are linked to each other</p>\n<p>Here’s a trivial example: my childhood memories. Look how many paths there are to get from my happy memories of playing to my traumatic memory of crashing my bike. But you have to activate a specific path to get to my memories of my GI Joe Lt. Falcon action figure.</p>\n<p>What that means for all of us is that, when we get far enough down our semantic network, only one frame is available to us; others are just too weakly-connected to flip over to, at least not without significant mental effort. This happened to me in a job interview once — I was working on GDPR compliance at my old job, so was thinking about privacy of PII. My interviewer asked me how to keep a variable’s value private in Javascript in the browser. The correct answer was &quot;using a closure,&quot; but, focused on the GDPR frame, I said something like &quot;once you send it to the browser, man, everyone can see it! It’s the wild west out there! There’s no privacy.&quot;<sup class=\"footnote-ref\"><a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" id=\"fnref4\">[4]</a></sup> The concept of &quot;private&quot; was framed in my mind as &quot;information,&quot; not &quot;variable private to a given function or method,&quot; so I missed it.</p>\n<p>This is all a long way of saying that the frame you use to filter information from the world around you absolutely neurologically limits your ability to think about that information in a different way. But, when we’re stuck on a programming (or, really, any life) challenge, thinking about the problem in a different way is essential to moving forward.</p>\n<h3 id=\"the-debugger-perspective\" tabindex=\"-1\">The Debugger Perspective <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\">#</a></h3>\n<p>It’s kind of obvious where I’m going here: using a debugger gives you a specific frame through which you look at the world. To be more exact, it gives you the frame of looking at the code from the outside.</p>\n<p>Which is great! This allows us all to use debuggers to understand code we have no business understanding. Third-party library? No problem! Spooky behavior potentially caused by the platform not adhering to the spec? I can figure that out!</p>\n<p>But it is that divorced-from-the-source-code frame, and it’s hard to get back into the code directly from the debugger. Not physically, since usually there’s a line number or even a link to the line in your IDE; but in your mental model. You need to store lots of state in your head: information of where you’re looking in your code; what drives the execution of that code; which inputs you care about; and more.</p>\n<p>Debugging is thus great if you have something behaving wrong and you don’t know why. You can use its frame to evacuate presuppositions from your head and look fresh from the outside.</p>\n<h3 id=\"the-logging-perspective\" tabindex=\"-1\">The Logging Perspective <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\">#</a></h3>\n<p>But, look, sometimes everything is going great. You’re writing code, you’re on a roll, but you need to know: what is the shape of this data here? Do these two lines really execute out-of-order? We fall into that branch, right?</p>\n<p>Then your perspective is inside the code. And what works well in that frame? Well, logging out the data that you need. Yeah, in a lot of cases you can set a breakpoint and watch what’s going on around that, but the point is that you don’t need a generic act that might give you all different kinds of information: you need to specifically get the piece of data you want.</p>\n<p>Logging gives you complete control of that. It defines the frame as &quot;I’m here, what’s the situation with ?&quot;</p>\n<p>Logging is also great when you’re refactoring. Want to make sure you’re still executing a step in some complex branching process that all flows back together in the end? Well, step through dozens of operations… or just put one <code>console.log('in interestingFunction()')</code> in the right place. Doesn’t matter how you change your branching structure, you don’t have to keep track of where you want to set the breakpoint, you just get the informtion you need, when it’s available.</p>\n<h3 id=\"can-t-we-all-just-get-along\" tabindex=\"-1\">Can’t We All Just Get Along? <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\">#</a></h3>\n<p>I may be a bad developer, but it’s not because I <code>console.log()</code> things a lot. You may be a good developer, but it’s not because you’re better with a debugger than I am.<sup class=\"footnote-ref\"><a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" id=\"fnref5\">[5]</a></sup></p>\n<p>But one part of what makes us good developers is our ability to look at problems in effective ways. So keep in mind the ways that you can use these two different debugging techniques to frame your approach to the problem in different ways. That gives you one more tool in your belt.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Rest not in peace, IE11 Developer Tools! <a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p>Developers should spend a lot more time reading social sciences <a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p>Yes, the frame is tricking the speaker there. Frames do that a lot <a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn4\" class=\"footnote-item\"><p>And yet, they hired me <a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn5\" class=\"footnote-item\"><p>I use my debugger all the time, so you might not be <a href=\"https://wadearmstrong.com/things/console-log_vs_breakpoint/\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n",
			"date_published": "2020-02-11T00:00:00Z"
		}
		,
		{
			"id": "https://wadearmstrong.com/things/sample_code_review_checklist/",
			"url": "https://wadearmstrong.com/things/sample_code_review_checklist/",
			"title": "Sample Code Review Checklist",
			"content_html": "<h1 id=\"sample-code-review-checklist\" tabindex=\"-1\">Sample Code Review Checklist <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h1>\n<h2 id=\"for-the-developer\" tabindex=\"-1\">For the Developer <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h2>\n<h3 id=\"developing-good-code\" tabindex=\"-1\">Developing Good Code <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h3>\n<ul>\n<li>Your code should comply with the Code Standards.</li>\n</ul>\n<h3 id=\"before-you-pr\" tabindex=\"-1\">Before You PR <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h3>\n<p>A good code review starts with a good pull request. Before you find yourself a reviewer for your code, make sure:</p>\n<ul>\n<li>Things that need docblocks have docblocks, and existing docblocks are up-to-date</li>\n<li>Existing tests pass</li>\n<li>All new code has unit tests</li>\n<li>You've removed <code>console.log()</code> and <code>var_dump()</code></li>\n<li>There's no commented-out code</li>\n<li>Your code builds successfully</li>\n<li>Your code does what it says on the label (if you have any concerns whether or not your code works, get someone from QE to educate you on the use cases you're developing for)</li>\n<li>You pulled from master, and resolved any merge conflicts</li>\n<li>You cleaned up your git timeline (commit, and even push, often; but only keep meaningful commits, that are also safe to roll back to, in the log)</li>\n</ul>\n<p>If you haven't done all of the above, then you won't get a code review -- your work will just get kicked back to you. Spend your time, and your reviewer's time, well, and do all of these first. Ask for help if you need it.</p>\n<h3 id=\"after-you-open-your-pr-but-before-you-get-a-reviewer\" tabindex=\"-1\">After You Open Your PR, but Before You Get a Reviewer <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h3>\n<ul>\n<li>Have you marked up your PR in order that people who haven't worked with the problem can easily understand your code?\n<ul>\n<li>All non-obvious pieces of code have a note on what they do and why</li>\n<li>If particular pieces of code match to particular requirements, explain how</li>\n<li>Any kludges are explained, especially why this kludge is actually the best option</li>\n</ul>\n</li>\n<li>If any TODOs are left, make sure you've opened tickets for them, and comment on them in the PR (on specific lines that make the need for these new tickets clear, if possible)</li>\n</ul>\n<h3 id=\"getting-a-reviewer\" tabindex=\"-1\">Getting a Reviewer <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h3>\n<ul>\n<li>Pick one randomly</li>\n<li>Don't review your own ticket</li>\n<li>If you think an SME should see your ticket, tag them</li>\n<li>Make sure your reviewer(s) know they're on the hook</li>\n</ul>\n<h2 id=\"for-the-reviewer\" tabindex=\"-1\">For the Reviewer <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h2>\n<h3 id=\"before-you-review\" tabindex=\"-1\">Before You Review <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h3>\n<ul>\n<li>If you're the named reviewer, it's your job to make the review work:\n<ul>\n<li>All PRs take 2 approvers; if there's only 1 assigned, get another</li>\n<li>If you know of an SME for the codebase, see if they'll do a review</li>\n<li>Once you and another person have signed off, move the ticket to Pre-UAT</li>\n</ul>\n</li>\n<li>Block out at least 1 hour</li>\n<li>Read the ticket and make sure you understand the requirements</li>\n<li>You should be able to trust that the code is fit for purpose, so spend time reviewing the written code rather than exercising the code in execution. But, if in doubt, pull and run the code.</li>\n</ul>\n<h3 id=\"early-returns-are-good-even-in-code-review\" tabindex=\"-1\">Early Returns are Good, Even In Code Review <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h3>\n<p>If any of the below are true, mark the code as Needs Work and bounce it right back:</p>\n<ul>\n<li>Existing tests don't pass</li>\n<li>No tests for new code</li>\n<li>Tests are unreadable</li>\n<li>Merge conflicts, no matter how trivial</li>\n<li>Git log is a mess</li>\n<li>Lots of <code>console.log()</code> or <code>var_dump()</code></li>\n<li>Lots of commented-out code</li>\n</ul>\n<h3 id=\"giving-good-code-review\" tabindex=\"-1\">Giving Good Code Review <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h3>\n<ul>\n<li>You should be able to understand how the code works, and why, by the end of your review</li>\n<li>Ask any questions you have within Stash; the other reviewers may have the same thought</li>\n<li>No comment or question is too small, but</li>\n<li>Read the code before asking how something works, even if it's code from another module</li>\n<li>Do the math/logic to make sure that all permutations of code flow are being tested</li>\n<li>Attend to the Code Standards as you look at the code; you may want to keep a checklist</li>\n</ul>\n<h2 id=\"further-reading\" tabindex=\"-1\">Further Reading <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/sample_code_review_checklist/\">#</a></h2>\n<ul>\n<li><a href=\"https://blog.fogcreek.com/increase-defect-detection-with-our-code-review-checklist-example/\">Fog Creek's 'Stop More Bugs with our Code Review Checklist</a></li>\n<li><a href=\"https://blog.codinghorror.com/code-smells/\">Jeff Atwood's 'Code Smells'</a></li>\n<li><a href=\"https://blog.smartbear.com/development/creating-your-code-review-checklist/\">'Creating Your Code Review Checklist' from SmartBear</a></li>\n<li><a href=\"https://dev.to/codemouse92/10-principles-of-a-good-code-review-2eg\">10 Principles of a Good Code Review</a></li>\n<li><a href=\"https://dev.to/samjarman/giving-and-receiving-great-code-reviews\">Giving and Receiving Great Code Reviews</a></li>\n<li><a href=\"https://blog.scottnonnenberg.com/top-ten-pull-request-review-mistakes/\">Top 10 Pull Request Review Mistakes</a></li>\n</ul>\n",
			"date_published": "2019-10-02T00:00:00Z"
		}
		,
		{
			"id": "https://wadearmstrong.com/things/why_to_use_ssh_proxy-command/",
			"url": "https://wadearmstrong.com/things/why_to_use_ssh_proxy-command/",
			"title": "Why To Use SSH ProxyCommand",
			"content_html": "<h1 id=\"you-should-switch-to-proxycommmand-with-ssh\" tabindex=\"-1\">You Should Switch to ProxyCommmand With SSH <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/why_to_use_ssh_proxy-command/\">#</a></h1>\n<p>SSH forwarding is great, but ProxyCommand lets you actually script how to make multiple jumps to get to a box.</p>\n<p>To set it up, do the following:</p>\n<ol>\n<li>Copy your public key to all the places you want it</li>\n</ol>\n<ul>\n<li>You may want to put your public key in puppet, but iff you put your <em>private</em> key in puppet, then everyone with access to Puppet can see it, so... no\n<ul>\n<li><code>mkdir .ssh</code></li>\n<li><code>vim .ssh/authorized_keys</code> and paste your private key there</li>\n</ul>\n</li>\n</ul>\n<ol start=\"2\">\n<li>On your laptop, create a file that looks like the following file at <code>.ssh/config</code></li>\n</ol>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">Host foo<br> User warmstrong<br> Hostname foo.yourdomain.dev<br><br>Host automation<br> User warmstrong<br> Hostname automation.yourdomain.dev<br><br>Host jump <span class=\"token comment\">#this creates a host aliased to \"jump\", now you can \"ssh jump\"</span><br> Hostname jumpbox.dom<br> User warmstrong<br> ProxyCommand <span class=\"token function\">ssh</span> <span class=\"token parameter variable\">-q</span> <span class=\"token parameter variable\">-W</span> %h:%p foo <span class=\"token comment\">#This means \"ssh to this box using foo\"</span><br><br>Host admin.other.dom<br> User warmstrong<br> ProxyCommand <span class=\"token function\">ssh</span> <span class=\"token parameter variable\">-q</span> <span class=\"token parameter variable\">-W</span> %h:%p foo <span class=\"token comment\">#Using the Hostname(%h) and Port(%p) you're using anyway, and passing stdio directly through(-W) but hiding errors(-q)</span><br><br>Host uat<br> User warmstrong<br> Hostname uat01.dom<br> ProxyCommand <span class=\"token function\">ssh</span> <span class=\"token parameter variable\">-q</span> <span class=\"token parameter variable\">-W</span> %h:%p jump <span class=\"token comment\">#Note that you're using the named jump box above to go here</span><br><br>Host logrepo<br> User warmstrong<br> Hostname logrepo.dom<br> ProxyCommand <span class=\"token function\">ssh</span> <span class=\"token parameter variable\">-q</span> <span class=\"token parameter variable\">-W</span> %h:%p jump <span class=\"token comment\">#SSH will resolve everything in the chain, so it figures out you need jump, jump needs foo, and does all those sshes to get there</span><br><br>Host static-server<br> User warmstrong<br> Hostname static.yourdomain.dom<br> ProxyCommand <span class=\"token function\">ssh</span> <span class=\"token parameter variable\">-q</span> <span class=\"token parameter variable\">-W</span> %h:%p jump <span class=\"token comment\">#Fun fact, -W means that this works for scp as well as ssh</span></code></pre>\n<ol start=\"3\">\n<li>You can now ssh directly to <code>uat</code>, <code>logrepo</code>, etc. without hitting multiple jump boxen.</li>\n</ol>\n",
			"date_published": "2019-09-14T00:00:00Z"
		}
		,
		{
			"id": "https://wadearmstrong.com/things/on-call_checklist/",
			"url": "https://wadearmstrong.com/things/on-call_checklist/",
			"title": "On-Call Checklist",
			"content_html": "<p>Did you get called for an issue? This checklist will help you make it through. <em>Do it in order</em>.</p>\n<ol>\n<li>If you were woken up, they can wait 2 minutes while you start some coffee. Don't make them wait much longer, but get that coffee started!</li>\n<li>Join chat. Announce your presence, and what team you're here for</li>\n<li><em>Slow down</em>. Take a few deep breaths.</li>\n<li>If this is an incident, make sure the Incident Manager (IM) explains to you <em>exactly the current understanding</em> of what's happening.</li>\n<li>If this is not an incident, then <em>feel free to ask NOC to clarify</em> what they see as going on</li>\n<li>Remember that you may be able to fix the problem, but <em>your biggest job is to route the problem to other people who can fix it</em>.</li>\n<li>Ask questions to confirm that they're actually dealing with your technology, and not some other part of the stack.</li>\n</ol>\n<ul>\n<li>If you <em>don't know what the thing is that is erroring</em>, call the secondary or tertiary. <em>A big part of the on-call job is routing info</em>.</li>\n<li>If it's some other part of the stack, recommend the team or person whom you'd contact outside of an incident; NOC will handle finding the person on-call from that team.</li>\n<li>If it's not your tech, share information to help prove it's not, but <em>stay on for at least a little while</em> while others confirm. <em>The longer you stay, the more you learn</em>.</li>\n</ul>\n<ol start=\"8\">\n<li>Once you know it's your tech, ask questions to make sure you understand the details of the issue:</li>\n</ol>\n<ul>\n<li>On what pages?</li>\n<li>On what part of the app?</li>\n<li>What actions have to be taken to cause the issue?</li>\n<li>What, specifically, is the degradation of user experience?</li>\n</ul>\n<ol start=\"9\">\n<li>If, at this time, <em>you don't understand what's going on</em> or <em>don't understand the technology,</em> call your backup (or the tertiary)</li>\n<li>Make sure that you agree this is a real emergency. If you don't think the degradation is that serious, speak up and explain why. You may be right, you're the expert!</li>\n<li>Take some more deep breaths. Look away from the screen. Make sure you have water/caffeinated beverage/etc. Take a sip. <em>Slow down</em>.</li>\n<li>Remember that you may be able to fix the problem, but <em>your biggest job is to route the problem to other people who can fix it</em>.</li>\n<li>If it is an emergency, find specifically what component is the problem.</li>\n<li>As you're working, if you're unsure about anything, ask the IM, or anyone else whom you recognize/trust, offline. <em>Everyone wants to help</em>!</li>\n<li>When looking for causes, note that, <em>during an emergency, only 2 things can be done</em>, so focus on solutions involving these:</li>\n</ol>\n<ul>\n<li>Roll back a release, so look for changes in the most recent release</li>\n<li>Override a config, so look for ways to turn off the problematic feature</li>\n</ul>\n<ol start=\"16\">\n<li>If you have a fix you're confident in, <em>speak up</em>.</li>\n</ol>\n<ul>\n<li>It's the IM's job to decide to do the fix or not, so give them the information!</li>\n<li>Remember you're the most-qualified person, in this particular area</li>\n<li>Propose the thing, then do it/make sure it gets done</li>\n</ul>\n<ol start=\"17\">\n<li>If you don't have a fix you're comfortable in, <em>it's ok to ask for help</em> - It's ok to act as a router, and not to directly fix</li>\n</ol>\n<ul>\n<li>If asked to implement a solution, or for the information to implement the solution, and you can do it, do it! You don't need anyone's approval. Don't call someone on just because you're nervous. This is why you get paid the big bucks!</li>\n<li>If you don't know the solution, make sure you at least know the problem and solution space, so that you can call in the right help\n<ul>\n<li>If during daytime, call on whomever you'd normally consider to be the SME for that area</li>\n<li>After-hours, have NOC call the secondary or tertiary, you have backup!</li>\n</ul>\n</li>\n<li>Remember that you may be able to fix the problem, but <em>your biggest job is to route the problem to other people who can fix it</em>.</li>\n<li>If you call in another team member to help, <em>make sure to stick around for the remainder of the incident</em>, and learn. Your goal should be to:\n<ul>\n<li>Learn enough to do it yourself next time <em>if this is one of the technologies we're responsible for</em></li>\n<li>Learn whom to escalate to, if not</li>\n</ul>\n</li>\n</ul>\n<ol start=\"18\">\n<li>Write up what you did in the on-call diary</li>\n</ol>\n",
			"date_published": "2019-08-24T00:00:00Z"
		}
		,
		{
			"id": "https://wadearmstrong.com/things/code_standards/",
			"url": "https://wadearmstrong.com/things/code_standards/",
			"title": "Code Standards",
			"content_html": "<h1 id=\"recommended-code-standards\" tabindex=\"-1\">Recommended Code Standards <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h1>\n<p>In my experience, these are standards that make code</p>\n<ul>\n<li>Better</li>\n<li>Easier-to-maintain</li>\n<li>More pleasant to deal with</li>\n</ul>\n<p>Try to use these as you write code. While the world is never nice and clean, and you'll break all of these sometime, try to at least do so consciously (and explain why, in your PR).</p>\n<h2 id=\"core-concepts\" tabindex=\"-1\">Core Concepts <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h2>\n<ul>\n<li>Maintain a good <a href=\"https://medium.com/@matryer/line-of-sight-in-code-186dd7cdea88\">code line of sight</a></li>\n<li>Keep the happy path obvious</li>\n<li>Return early</li>\n<li>Don't reinvent the wheel</li>\n<li>Override the least possible, and contribute the most possible back to the core</li>\n<li>When creating something new, make it possible to override</li>\n<li>Code should be easy for the next developer to understand</li>\n<li>Prefer clarity and readability to brilliance or cleverness</li>\n</ul>\n<h2 id=\"applying-these-concepts-to-details\" tabindex=\"-1\">Applying These Concepts To Details <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h2>\n<h3 id=\"rules-of-thumb\" tabindex=\"-1\">Rules of Thumb <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h3>\n<ul>\n<li>Rather than</li>\n</ul>\n<pre class=\"language-javascript\" tabindex=\"0\"><code class=\"language-javascript\"><span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>happy<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">do</span> 1st happy thing<span class=\"token punctuation\">;</span><br>  <span class=\"token operator\">...</span><br>  <span class=\"token keyword\">do</span> nth happy thing<span class=\"token punctuation\">;</span><br><span class=\"token punctuation\">}</span> <span class=\"token keyword\">else</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">throw</span> <span class=\"token function\">tantrum</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>try</p>\n<pre class=\"language-javascript\" tabindex=\"0\"><code class=\"language-javascript\"><span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span><span class=\"token operator\">!</span>happy<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br> <span class=\"token keyword\">throw</span> <span class=\"token function\">tantrum</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br><span class=\"token punctuation\">}</span><br><span class=\"token keyword\">do</span> 1st happy thing<span class=\"token punctuation\">;</span><br><span class=\"token operator\">...</span><br><span class=\"token keyword\">do</span> nth happy thing<span class=\"token punctuation\">;</span></code></pre>\n<ul>\n<li>If you do the above, you probably don't need an <code>else</code></li>\n<li>The above is a really good way to <code>return</code> early, before you do any real work, when you're outside the happy path</li>\n<li>If there are several <code>if</code> s in a row, consider a <code>switch</code> statement</li>\n<li>Name things well. Be clear about what data they contain/tasks they do. Related things have related names</li>\n<li>Always return from functions. Always return the same datatype from a given function</li>\n<li>Break out reusable behavior into its own function, but</li>\n<li>Don't put an excessive number of functions on the call stack</li>\n<li>Your class should have an interface like similar classes; your function should have a signature like similar functions</li>\n<li>Make things configurable and those configurations overridable</li>\n</ul>\n<h3 id=\"usefulness\" tabindex=\"-1\">Usefulness <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h3>\n<ul>\n<li>Did you really need to override the <em>entire</em> template?</li>\n<li>Are any magic numbers set in a config file? Can that config file be overridden?</li>\n</ul>\n<h3 id=\"readability\" tabindex=\"-1\">Readability <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h3>\n<ul>\n<li>Are all of your functions explained in docblocks? Do the explanations actually match the current code, and are all parameters actually documented?</li>\n<li>Do not nest ternaries. Save your logical comparisons in well-named variables and compare those</li>\n<li>Don't rely on the next developer to remember the order of arithmetic or logical operations; group parts of statements with parentheses to make your meaning obvious</li>\n<li>Comments explain <em>why</em> you did it, not <em>what</em> it does</li>\n<li>Functions do one thing</li>\n<li>Four parameters for a function is probably too many</li>\n<li>You should be able to read the entire method/function without scrolling</li>\n<li>Don't Repeat Yourself</li>\n<li>Constants are UPPERCASE even if you <code>const</code> them</li>\n<li>Write comments just like you'd explain something to another developer; don't feel like you need to use fancy, formal language</li>\n</ul>\n<h3 id=\"performance\" tabindex=\"-1\">Performance <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h3>\n<ul>\n<li>Do you save the value of expensive calculations in a variable, and then reference that variable? Are even cheap calculations not done once per loop iteration when they could be done just once?</li>\n<li>Do you use temporary variables inside loops, to make it easy to understand what the calculation is?</li>\n<li>For Javascript, do you declare variables outside loops, and update them inside?</li>\n<li>Are you sure that loop will end?</li>\n</ul>\n<h3 id=\"security\" tabindex=\"-1\">Security <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h3>\n<ul>\n<li>If you're accepting input from the user, an API, or another component, do you validate that input is safe and of the right type, length, etc.?</li>\n<li>If you get bad input, do you handle it well?</li>\n<li>What happens if this gets passed a string containing Unicode characters? Does it not just handle it, but handle it correctly?</li>\n<li>What happens if someone passes a <code>&lt;script&gt;</code> tag into your code?</li>\n<li>If you're using PHP, <em>all</em> DB access should be via PDO. <a href=\"https://xkcd.com/327/\">Don't concatenate your own SQL statement</a>.</li>\n</ul>\n<h3 id=\"testing\" tabindex=\"-1\">Testing <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h3>\n<ul>\n<li>Do your tests cover both the happy path and <strong>all</strong> error paths?</li>\n<li>Do your tests detect breakage?</li>\n<li>Are your tests brittle? Will they fail if someone changes an html attribute or the order in which attributes are assigned to an object? Do they have to fail under those circumstances?</li>\n<li>If you're testing with strings, have you tested with unicode strings?</li>\n<li>Do your unit tests actually test units, and not modules in integration?</li>\n</ul>\n<h3 id=\"cleanliness\" tabindex=\"-1\">Cleanliness <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h3>\n<ul>\n<li>Don't leave in TODOs, ticket them up</li>\n<li>Delete commented-out code in a PR</li>\n<li>Each PR should only include commits that it's safe to roll back to; squash your commits before making a PR</li>\n</ul>\n<h3 id=\"formatting\" tabindex=\"-1\">Formatting <a class=\"header-anchor\" href=\"https://wadearmstrong.com/things/code_standards/\">#</a></h3>\n<ul>\n<li>If writing PHP, generally follow <a href=\"https://github.com/php-fig/fig-standards/blob/master/accepted/PSR-2-coding-style-guide.md\">PSR2</a>, except for a few things:\n<ul>\n<li>Tabs are clearly superior to spaces, so we use them</li>\n<li><code>TRUE</code>, <code>FALSE</code>, and <code>NULL</code> are generally capitalized, although this is not required</li>\n</ul>\n</li>\n<li>If writing Javascript, you <em>must</em> be running <a href=\"https://eslint.org/\">ESlint</a> and using an agreed-upon and shared config. If you do not lint your code then you will be mocked ceaselessly for any style violations</li>\n<li><code>variablesAreCamelCase</code></li>\n<li><code>indexes['are_snake_case']</code></li>\n<li><code>_</code> doesn't actually make your method or variable private so don't use it</li>\n</ul>\n",
			"date_published": "2019-07-04T00:00:00Z"
		}
		
	]
}
